/***************************************************************************
	Wdt_lib.h
	ウォッチドッグタイマライブラリ取り込み用ヘッダ

	マイコン: LPC8xx(NXP Semiconductors)

	変更履歴
	2014.06.07: mits: 新規作成
***************************************************************************/
#ifndef	WDT_LIB_H
#define	WDT_LIB_H

/***************************************************************************
	グローバル関数
***************************************************************************/
void		Wdt_ini(void);			/* WWDTユニットの初期化 */
uint32_t	Wdt_getOscClk(void);	/* WDT用オシレータの周波数(※Wdt_ini後に使用可能) */
void		Wdt_clr(void);			/* WDTクリア */

#endif	/* WDT_LIB_H */
